; domain
(define (domain transport-logistics)
  (:requirements :strips :typing)
  (:types city package truck plane ship)

  (:predicates
    (at-truck ?t - truck ?c - city)
    (at-plane ?p - plane ?c - city)
    (at-ship ?s - ship ?c - city)
    (at-package ?p - package ?c - city)
    (in-truck ?p - package ?t - truck)
    (in-plane ?p - package ?pl - plane)
    (in-ship ?p - package ?s - ship)
    (road ?c1 - city ?c2 - city)
    (air-route ?c1 - city ?c2 - city)
    (sea-route ?c1 - city ?c2 - city)
    (has-airport ?c - city)
    (has-port ?c - city)
  )

  ;; === TRANSPORT DROGOWY ===
  (:action drive
    :parameters (?t - truck ?from - city ?to - city)
    :precondition (and (at-truck ?t ?from) (road ?from ?to))
    :effect (and (at-truck ?t ?to) (not (at-truck ?t ?from)))
  )

  ;; === TRANSPORT LOTNICZY ===
  (:action fly
    :parameters (?pl - plane ?from - city ?to - city)
    :precondition (and
      (at-plane ?pl ?from)
      (has-airport ?from)
      (has-airport ?to)
      (air-route ?from ?to)
    )
    :effect (and (at-plane ?pl ?to) (not (at-plane ?pl ?from)))
  )

  ;; === TRANSPORT WODNY ===
  (:action sail
    :parameters (?s - ship ?from - city ?to - city)
    :precondition (and
      (at-ship ?s ?from)
      (has-port ?from)
      (has-port ?to)
      (sea-route ?from ?to)
    )
    :effect (and (at-ship ?s ?to) (not (at-ship ?s ?from)))
  )

  ;; === ZAŁADUNEK / ROZŁADUNEK - CIĘŻARÓWKA ===
  (:action load-truck
    :parameters (?p - package ?t - truck ?c - city)
    :precondition (and (at-package ?p ?c) (at-truck ?t ?c))
    :effect (and (in-truck ?p ?t) (not (at-package ?p ?c)))
  )

  (:action unload-truck
    :parameters (?p - package ?t - truck ?c - city)
    :precondition (and (in-truck ?p ?t) (at-truck ?t ?c))
    :effect (and (at-package ?p ?c) (not (in-truck ?p ?t)))
  )

  ;; === ZAŁADUNEK / ROZŁADUNEK - SAMOLOT ===
  (:action load-plane
    :parameters (?p - package ?pl - plane ?c - city)
    :precondition (and (at-package ?p ?c) (at-plane ?pl ?c))
    :effect (and (in-plane ?p ?pl) (not (at-package ?p ?c)))
  )

  (:action unload-plane
    :parameters (?p - package ?pl - plane ?c - city)
    :precondition (and (in-plane ?p ?pl) (at-plane ?pl ?c))
    :effect (and (at-package ?p ?c) (not (in-plane ?p ?pl)))
  )

  ;; === ZAŁADUNEK / ROZŁADUNEK - STATEK ===
  (:action load-ship
    :parameters (?p - package ?s - ship ?c - city)
    :precondition (and (at-package ?p ?c) (at-ship ?s ?c))
    :effect (and (in-ship ?p ?s) (not (at-package ?p ?c)))
  )

  (:action unload-ship
    :parameters (?p - package ?s - ship ?c - city)
    :precondition (and (in-ship ?p ?s) (at-ship ?s ?c))
    :effect (and (at-package ?p ?c) (not (in-ship ?p ?s)))
  )
)

; problem
(define (problem deliver-packages)
  (:domain transport-logistics)

  (:objects
    wroclaw poznan gdansk krakow warszawa - city
    paczka1 paczka2 paczka3 paczka4 - package
    truck1 truck2 - truck
    plane1 - plane
    ship1 - ship
  )

  (:init
    ;; --- Pozycje pojazdów ---
    (at-truck truck1 wroclaw)
    (at-truck truck2 warszawa)
    (at-plane plane1 wroclaw)
    (at-ship ship1 gdansk)

    ;; --- Pozycje paczek ---
    (at-package paczka1 wroclaw)   ; cel: gdansk
    (at-package paczka2 krakow)    ; cel: poznan
    (at-package paczka3 warszawa)  ; cel: wroclaw
    (at-package paczka4 gdansk)    ; cel: krakow

    ;; --- Drogi (dwukierunkowe) ---
    (road wroclaw poznan) (road poznan wroclaw)
    (road poznan gdansk)  (road gdansk poznan)
    (road wroclaw krakow) (road krakow wroclaw)
    (road krakow warszawa) (road warszawa krakow)
    (road poznan warszawa) (road warszawa poznan)

    ;; --- Trasy lotnicze (dwukierunkowe) ---
    (air-route wroclaw warszawa) (air-route warszawa wroclaw)
    (air-route wroclaw gdansk)   (air-route gdansk wroclaw)

    ;; --- Trasy morskie (dwukierunkowe) ---
    (sea-route gdansk warszawa) (sea-route warszawa gdansk)

    ;; --- Infrastruktura ---
    (has-airport wroclaw)
    (has-airport warszawa)
    (has-airport gdansk)
    (has-port gdansk)
    (has-port warszawa)
  )

  (:goal
    (and
      (at-package paczka1 gdansk)
      (at-package paczka2 poznan)
      (at-package paczka3 wroclaw)
      (at-package paczka4 krakow)
    )
  )
)

; plan
1. (load-truck paczka3 truck2 warszawa)
   deleted: (at-package paczka3 warszawa)
   added: (in-truck paczka3 truck2)
   goals met: 0 of 4
2. (load-ship paczka4 ship1 gdansk)
   deleted: (at-package paczka4 gdansk)
   added: (in-ship paczka4 ship1)
   goals met: 0 of 4
3. (sail ship1 gdansk warszawa)
   deleted: (at-ship ship1 gdansk)
   added: (at-ship ship1 warszawa)
   goals met: 0 of 4
4. (unload-ship paczka4 ship1 warszawa)
   deleted: (in-ship paczka4 ship1)
   added: (at-package paczka4 warszawa)
   goals met: 0 of 4
5. (load-truck paczka4 truck2 warszawa)
   deleted: (at-package paczka4 warszawa)
   added: (in-truck paczka4 truck2)
   goals met: 0 of 4
6. (drive truck2 warszawa krakow)
   deleted: (at-truck truck2 warszawa)
   added: (at-truck truck2 krakow)
   goals met: 0 of 4
7. (unload-truck paczka4 truck2 krakow)
   deleted: (in-truck paczka4 truck2)
   added: (at-package paczka4 krakow)
   goals met: 1 of 4
8. (load-truck paczka2 truck2 krakow)
   deleted: (at-package paczka2 krakow)
   added: (in-truck paczka2 truck2)
   goals met: 1 of 4
9. (drive truck2 krakow wroclaw)
   deleted: (at-truck truck2 krakow)
   added: (at-truck truck2 wroclaw)
   goals met: 1 of 4
10. (unload-truck paczka3 truck2 wroclaw)
   deleted: (in-truck paczka3 truck2)
   added: (at-package paczka3 wroclaw)
   goals met: 2 of 4
11. (load-truck paczka1 truck2 wroclaw)
   deleted: (at-package paczka1 wroclaw)
   added: (in-truck paczka1 truck2)
   goals met: 2 of 4
12. (drive truck2 wroclaw poznan)
   deleted: (at-truck truck2 wroclaw)
   added: (at-truck truck2 poznan)
   goals met: 2 of 4
13. (unload-truck paczka2 truck2 poznan)
   deleted: (in-truck paczka2 truck2)
   added: (at-package paczka2 poznan)
   goals met: 3 of 4
14. (drive truck2 poznan gdansk)
   deleted: (at-truck truck2 poznan)
   added: (at-truck truck2 gdansk)
   goals met: 3 of 4
15. (unload-truck paczka1 truck2 gdansk)
   deleted: (in-truck paczka1 truck2)
   added: (at-package paczka1 gdansk)
   goals met: 4 of 4
